# GetHtmlDescription Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipePlumbingFixtureFlowServer..::..GetHtmlDescription Method
IPipePlumbingFixtureFlowServer Interface See Also
---
The method that Revit will invoke to get an HTML formatted description of the server.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
string GetHtmlDescription()
```

Visual Basic
---
```text
Function GetHtmlDescription As String
```

Visual C++
---
```text
String^ GetHtmlDescription()
```

# ### Return Value
The HTML format description of the server.
# Remarks
The HTML description is used by Revit unless it is empty or the server is not available, in which case, Revit will use the plain text description from IExternalServer.GetDescription().
# See Also
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace